cmsis-svd/cmsis-svd/data/Spansion/MB9BF12xJ_svd.xml
    <!-- PERIPHERAL "INTREQ" -->
    <peripheral>
      <name>INTREQ</name>
      <description> peripheral INTREQ </description>
      <groupName>INTREQ</groupName>
      <baseAddress>0x40031000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xB</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0xC4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x210</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "DRQSEL" -->
        <register>
          <name>DRQSEL</name>
          <description> register DRQSEL </description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EXINT3" -->
            <field>
              <name>EXINT3</name>
              <description> bitfield EXINT3 </description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EXINT2" -->
            <field>
              <name>EXINT2</name>
              <description> bitfield EXINT2 </description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EXINT1" -->
            <field>
              <name>EXINT1</name>
              <description> bitfield EXINT1 </description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EXINT0" -->
            <field>
              <name>EXINT0</name>
              <description> bitfield EXINT0 </description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFS7TX" -->
            <field>
              <name>MFS7TX</name>
              <description> bitfield MFS7TX </description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFS7RX" -->
            <field>
              <name>MFS7RX</name>
              <description> bitfield MFS7RX </description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFS6TX" -->
            <field>
              <name>MFS6TX</name>
              <description> bitfield MFS6TX </description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFS6RX" -->
            <field>
              <name>MFS6RX</name>
              <description> bitfield MFS6RX </description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFS5TX" -->
            <field>
              <name>MFS5TX</name>
              <description> bitfield MFS5TX </description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFS5RX" -->
            <field>
              <name>MFS5RX</name>
              <description> bitfield MFS5RX </description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFS4TX" -->
            <field>
              <name>MFS4TX</name>
              <description> bitfield MFS4TX </description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFS4RX" -->
            <field>
              <name>MFS4RX</name>
              <description> bitfield MFS4RX </description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFS3TX" -->
            <field>
              <name>MFS3TX</name>
              <description> bitfield MFS3TX </description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFS3RX" -->
            <field>
              <name>MFS3RX</name>
              <description> bitfield MFS3RX </description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFS2TX" -->
            <field>
              <name>MFS2TX</name>
              <description> bitfield MFS2TX </description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFS2RX" -->
            <field>
              <name>MFS2RX</name>
              <description> bitfield MFS2RX </description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFS1TX" -->
            <field>
              <name>MFS1TX</name>
              <description> bitfield MFS1TX </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFS1RX" -->
            <field>
              <name>MFS1RX</name>
              <description> bitfield MFS1RX </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFS0TX" -->
            <field>
              <name>MFS0TX</name>
              <description> bitfield MFS0TX </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFS0RX" -->
            <field>
              <name>MFS0RX</name>
              <description> bitfield MFS0RX </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IRQ0BT6" -->
            <field>
              <name>IRQ0BT6</name>
              <description> bitfield IRQ0BT6 </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IRQ0BT4" -->
            <field>
              <name>IRQ0BT4</name>
              <description> bitfield IRQ0BT4 </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IRQ0BT2" -->
            <field>
              <name>IRQ0BT2</name>
              <description> bitfield IRQ0BT2 </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IRQ0BT0" -->
            <field>
              <name>IRQ0BT0</name>
              <description> bitfield IRQ0BT0 </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADCSCAN2" -->
            <field>
              <name>ADCSCAN2</name>
              <description> bitfield ADCSCAN2 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADCSCAN1" -->
            <field>
              <name>ADCSCAN1</name>
              <description> bitfield ADCSCAN1 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADCSCAN0" -->
            <field>
              <name>ADCSCAN0</name>
              <description> bitfield ADCSCAN0 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "USBEP5" -->
            <field>
              <name>USBEP5</name>
              <description> bitfield USBEP5 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "USBEP4" -->
            <field>
              <name>USBEP4</name>
              <description> bitfield USBEP4 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "USBEP3" -->
            <field>
              <name>USBEP3</name>
              <description> bitfield USBEP3 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "USBEP2" -->
            <field>
              <name>USBEP2</name>
              <description> bitfield USBEP2 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "USBEP1" -->
            <field>
              <name>USBEP1</name>
              <description> bitfield USBEP1 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ODDPKS" -->
        <register>
          <name>ODDPKS</name>
          <description> register ODDPKS </description>
          <addressOffset>0xB</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
        </register>
