cmsis-svd/cmsis-svd/data/Spansion/MB9BF12xJ_svd.xml
        <!-- REGISTER "DMACDA1" -->
        <register derivedFrom="DMACDA0">
          <name>DMACDA1</name>
          <description> register DMACDA1 </description>
          <addressOffset>0x2C</addressOffset>
        </register>
        <!-- REGISTER "DMACA2" -->
        <register derivedFrom="DMACA0">
          <name>DMACA2</name>
          <description> register DMACA2 </description>
          <addressOffset>0x30</addressOffset>
        </register>
        <!-- REGISTER "DMACB2" -->
        <register derivedFrom="DMACB0">
          <name>DMACB2</name>
          <description> register DMACB2 </description>
          <addressOffset>0x34</addressOffset>
        </register>
        <!-- REGISTER "DMACSA2" -->
        <register derivedFrom="DMACSA0">
          <name>DMACSA2</name>
          <description> register DMACSA2 </description>
          <addressOffset>0x38</addressOffset>
        </register>
        <!-- REGISTER "DMACDA2" -->
        <register derivedFrom="DMACDA0">
          <name>DMACDA2</name>
          <description> register DMACDA2 </description>
          <addressOffset>0x3C</addressOffset>
        </register>
        <!-- REGISTER "DMACA3" -->
        <register derivedFrom="DMACA0">
          <name>DMACA3</name>
          <description> register DMACA3 </description>
          <addressOffset>0x40</addressOffset>
        </register>
        <!-- REGISTER "DMACB3" -->
        <register derivedFrom="DMACB0">
          <name>DMACB3</name>
          <description> register DMACB3 </description>
          <addressOffset>0x44</addressOffset>
        </register>
        <!-- REGISTER "DMACSA3" -->
        <register derivedFrom="DMACSA0">
          <name>DMACSA3</name>
          <description> register DMACSA3 </description>
          <addressOffset>0x48</addressOffset>
        </register>
        <!-- REGISTER "DMACDA3" -->
        <register derivedFrom="DMACDA0">
          <name>DMACDA3</name>
          <description> register DMACDA3 </description>
          <addressOffset>0x4C</addressOffset>
        </register>
      </registers>
    </peripheral>
 </peripherals>
</device>